app/Controllers/BarangController.php

    public function index()
    {
        $model = new BarangModel();
        $data['barang'] = $model->findAll();
---
SELECT *
FROM `barang`

    public function edit($id)
    {
        $model = new BarangModel();
        $data['barang'] = $model->find($id);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'