app/Controllers/SupplierController.php

SELECT *
FROM `supplier`
---
    public function index()
    {
        $model = new SupplierModel();
        $data['supplier'] = $model->findAll();

SELECT *
FROM `supplier`
WHERE `supplier`.`id` = '3'
---
    public function edit($id)
    {
        $model = new SupplierModel();
        $data['supplier'] = $model->find($id);