app/Controllers/TransaksiController.php

    public function create()
    {
        $userModel = new UserModel();
        $barangModel = new BarangModel();
        $supplierModel = new SupplierModel();

        $data['users'] = $userModel->findAll();
        $data['barang'] = $barangModel->findAll();
        $data['suppliers'] = $supplierModel->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `barang`
SELECT *
FROM `supplier`

    public function store()
    {
        $data = [
            'user_id' => $this->request->getPost('user_id'),
            'barang_id' => $this->request->getPost('barang_id'),
            'supplier_id' => $this->request->getPost('supplier_id'),
            'quantity' => $this->request->getPost('quantity'),
            'harga' => $this->request->getPost('harga'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s')
        ];

        $this->transaksiModel->insert($data);
---
INSERT INTO `transaksi` (`user_id`, `barang_id`, `supplier_id`, `quantity`, `harga`, `created_at`, `updated_at`) VALUES ('1', '2', '2', '5', '15000', '2023-06-19 15:54:40', '2023-06-19 15:54:40')

    public function edit($id)
    {
        $data['transaksi'] = $this->transaksiModel->find($id);

        $userModel = new UserModel();
        $barangModel = new BarangModel();
        $supplierModel = new SupplierModel();

        $data['users'] = $userModel->findAll();
        $data['barang'] = $barangModel->findAll();
        $data['suppliers'] = $supplierModel->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `barang`
SELECT *
FROM `supplier`