app/Models/TransaksiModel.php

SELECT `transaksi`.*, `users`.`username` as `nama_user`, `supplier`.`nama_supplier` as `nama_supplier`, `barang`.`nama_barang` as `nama_barang`
FROM `transaksi`
JOIN `users` ON `users`.`id` = `transaksi`.`user_id`
JOIN `supplier` ON `supplier`.`id` = `transaksi`.`supplier_id`
JOIN `barang` ON `barang`.`id` = `transaksi`.`barang_id`
---
    public function getAllTransaksi()
    {
        return $this->join('users', 'users.id = transaksi.user_id')
            ->join('supplier', 'supplier.id = transaksi.supplier_id')
            ->join('barang', 'barang.id = transaksi.barang_id')
            ->select('transaksi.*, users.username as nama_user, supplier.nama_supplier as nama_supplier, barang.nama_barang as nama_barang')
            ->findAll();